Show / Hide Table of Contents
Class GrpcService.GrpcServiceBase
Base class for server-side implementations of GrpcService
Inheritance
System.Object
GrpcService.GrpcServiceBase
GrpcServer
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaStatiCa.Plugin.Grpc
Assembly: IdeaStatiCa.Plugin.dll
Syntax
[BindServiceMethod(typeof(GrpcService), "BindService")]
public abstract class GrpcServiceBase
Methods
Improve this Doc   View Source
ConnectAsync(IAsyncStreamReader<GrpcMessage>, IServerStreamWriter<GrpcMessage>, ServerCallContext)
Declaration
public virtual Task ConnectAsync(IAsyncStreamReader<GrpcMessage> requestStream, IServerStreamWriter<GrpcMessage> responseStream, ServerCallContext context)
Parameters
 Type |  Name |  Description
 Grpc.Core.IAsyncStreamReader<GrpcMessage> |  requestStream
 Grpc.Core.IServerStreamWriter<GrpcMessage> |  responseStream
 Grpc.Core.ServerCallContext |  context
Returns
 Type |  Description
 System.Threading.Tasks.Task
 Improve this Doc
 View Source